app/controllers/records_controller.rb

    def index

       @record = Record.all
---
SELECT "records".* FROM "records"

    def create

    @record = Record.new(params.require(:record).permit(:name,:address,:age))
    authorize @record
       if @record.save
---
INSERT INTO "records" ("name", "address", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "prince"], ["address", "Bihar"], ["age", 1994], ["created_at", "2023-01-31 18:14:16.183127"], ["updated_at", "2023-01-31 18:14:16.183127"]]

   def show
       @record = Record.find(params[:id])
       @user=User.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def edit
        @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

   def update
        @record = Record.find(params[:id])
        authorize @record
       if @record.update(params.require(:record).permit(:name,:address,:age))
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "records" SET "name" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["name", "Mohan Ranga edited"], ["updated_at", "2023-01-30 16:56:47.929950"], ["id", 1]]